// Copyright Colby Hall. All Rights Reserved.

#pragma once

// Determine platform
#if defined(_WIN32) || defined(_WIN64)
	#include <winapifamily.h>
	#if WINAPI_FAMILY == WINAPI_FAMILY_APP
		#define PLATFORM_WINDOWS_UWP
	#endif
	#define PLATFORM_WINDOWS
#else
	#error Unsupported platform
#endif

// Determine compiler
#if defined(__clang__)
	#define COMPILER_CLANG
#elif defined(_MSC_VER)
	#define COMPILER_MSVC
#else
	#error Unsupported compiler
#endif

// Detect CPU architecture
#if defined(__x86_64__) || defined(_M_X64) || defined(__i386__) ||             \
	defined(_M_IX86)
	// X86 CPU architecture
	#define CPU_X86
	#if defined(__x86_64__) || defined(_M_X64)
		#define CPU_ADDRESS_BITS 64
	#else
		#define CPU_ADDRESS_BITS 32
	#endif
#else
	#error Unsupported CPU architecture
#endif

// Pragmas to store / restore the warning state and to disable individual
// warnings
#ifdef COMPILER_CLANG
	#define PRAGMA(x)				  _Pragma(#x)
	#define SUPPRESS_WARNING_PUSH	  PRAGMA(clang diagnostic push)
	#define SUPPRESS_WARNING_POP	  PRAGMA(clang diagnostic pop)
	#define CLANG_SUPPRESS_WARNING(w) PRAGMA(clang diagnostic ignored w)
#else
	#define CLANG_SUPPRESS_WARNING(w)
#endif

#ifdef COMPILER_MSVC
	#define PRAGMA(x)				 __pragma(x)
	#define SUPPRESS_WARNING_PUSH	 PRAGMA(warning(push))
	#define SUPPRESS_WARNING_POP	 PRAGMA(warning(pop))
	#define MSVC_SUPPRESS_WARNING(w) PRAGMA(warning(disable : w))
#else
	#define MSVC_SUPPRESS_WARNING(w)
#endif

// Define inline macro
#if defined(COMPILER_CLANG)
	#define ALWAYS_INLINE __inline__ __attribute__((always_inline))
#elif defined(COMPILER_MSVC)
	#define ALWAYS_INLINE __forceinline
#else
	#error Undefined inline
#endif

// Cache line size (used for aligning to cache line)
#ifndef CACHE_LINE_SIZE
	#define CACHE_LINE_SIZE 64
#endif

// Define macro to get current function name
#if defined(COMPILER_CLANG) || defined(COMPILER_GCC)
	#define FUNCTION_NAME __PRETTY_FUNCTION__
#elif defined(COMPILER_MSVC)
	#define FUNCTION_NAME __FUNCTION__
#else
	#error Undefined
#endif

// OS-specific includes
#if defined(PLATFORM_WINDOWS)
	#define BREAKPOINT __debugbreak()
#else
	#error Unknown platform
#endif

#ifdef _DEBUG
	#define BUILD_DEBUG
#endif

#define THREAD_LOCAL __declspec(thread)

// Macro to indicate that a parameter / variable is unused
#define UNUSED(x) (void)x

// Crashes the application
#define CRASH                                                                  \
	SUPPRESS_WARNING_PUSH                                                      \
	MSVC_SUPPRESS_WARNING(6011)                                                \
	do {                                                                       \
		int* _ptr = nullptr;                                                   \
		*_ptr = 0;                                                             \
	} while (false) SUPPRESS_WARNING_POP

// Suppress warnings generated by the standard template library
#define SUPPRESS_WARNINGS_STD_BEGIN                                            \
	SUPPRESS_WARNING_PUSH                                                      \
	MSVC_SUPPRESS_WARNING(4619)                                                \
	MSVC_SUPPRESS_WARNING(4710)                                                \
	MSVC_SUPPRESS_WARNING(4711)                                                \
	MSVC_SUPPRESS_WARNING(4820)                                                \
	MSVC_SUPPRESS_WARNING(4514)                                                \
	MSVC_SUPPRESS_WARNING(5262)                                                \
	MSVC_SUPPRESS_WARNING(5264)                                                \
	MSVC_SUPPRESS_WARNING(4365)                                                \
	MSVC_SUPPRESS_WARNING(5219)

#define SUPPRESS_WARNINGS_STD_END SUPPRESS_WARNING_POP

// Disable common warnings triggered by core when compiling with -Wall
#define SUPPRESS_WARNINGS                                                      \
	CLANG_SUPPRESS_WARNING("-Wc++98-compat")                                   \
	CLANG_SUPPRESS_WARNING("-Wc++98-compat-pedantic")                          \
	CLANG_SUPPRESS_WARNING("-Wfloat-equal")                                    \
	CLANG_SUPPRESS_WARNING("-Wsign-conversion")                                \
	CLANG_SUPPRESS_WARNING("-Wold-style-cast")                                 \
	CLANG_SUPPRESS_WARNING("-Wgnu-anonymous-struct")                           \
	CLANG_SUPPRESS_WARNING("-Wnested-anon-types")                              \
	CLANG_SUPPRESS_WARNING("-Wglobal-constructors")                            \
	CLANG_SUPPRESS_WARNING("-Wexit-time-destructors")                          \
	CLANG_SUPPRESS_WARNING("-Wnonportable-system-include-path")                \
	CLANG_SUPPRESS_WARNING("-Wlanguage-extension-token")                       \
	CLANG_SUPPRESS_WARNING("-Wunused-parameter")                               \
	CLANG_SUPPRESS_WARNING("-Wformat-nonliteral")                              \
	CLANG_SUPPRESS_WARNING("-Wcovered-switch-default")                         \
	CLANG_SUPPRESS_WARNING("-Wcast-align")                                     \
	CLANG_SUPPRESS_WARNING("-Winvalid-offsetof")                               \
	CLANG_SUPPRESS_WARNING("-Wgnu-zero-variadic-macro-arguments")              \
	CLANG_SUPPRESS_WARNING("-Wdocumentation-unknown-command")                  \
	CLANG_SUPPRESS_WARNING("-Wctad-maybe-unsupported")                         \
	CLANG_SUPPRESS_WARNING("-Wdeprecated-copy")                                \
	CLANG_SUPPRESS_WARNING("-Wimplicit-int-float-conversion")                  \
                                                                               \
	MSVC_SUPPRESS_WARNING(4619)                                                \
	MSVC_SUPPRESS_WARNING(4514)                                                \
	MSVC_SUPPRESS_WARNING(4710)                                                \
	MSVC_SUPPRESS_WARNING(4711)                                                \
	MSVC_SUPPRESS_WARNING(4820)                                                \
	MSVC_SUPPRESS_WARNING(4100)                                                \
	MSVC_SUPPRESS_WARNING(4626)                                                \
	MSVC_SUPPRESS_WARNING(5027)                                                \
	MSVC_SUPPRESS_WARNING(4365)                                                \
	MSVC_SUPPRESS_WARNING(4324)                                                \
	MSVC_SUPPRESS_WARNING(4625)                                                \
	MSVC_SUPPRESS_WARNING(5026)                                                \
	MSVC_SUPPRESS_WARNING(4623)                                                \
	MSVC_SUPPRESS_WARNING(4201)                                                \
	MSVC_SUPPRESS_WARNING(4371)                                                \
	MSVC_SUPPRESS_WARNING(5045)                                                \
	MSVC_SUPPRESS_WARNING(4583)                                                \
	MSVC_SUPPRESS_WARNING(4582)                                                \
	MSVC_SUPPRESS_WARNING(5219)                                                \
	MSVC_SUPPRESS_WARNING(4826)                                                \
	MSVC_SUPPRESS_WARNING(5264)                                                \
	MSVC_SUPPRESS_WARNING(4127)

// Begin the core namespace
#define CORE_NAMESPACE_BEGIN                                                   \
	SUPPRESS_WARNING_PUSH                                                      \
	SUPPRESS_WARNINGS                                                          \
	namespace eu {                                                             \
	namespace core {

// End the core namespace
#define CORE_NAMESPACE_END                                                     \
	}                                                                          \
	}                                                                          \
	SUPPRESS_WARNING_POP

// Declare primitive types under core namespace
CORE_NAMESPACE_BEGIN

using u8 = unsigned char;
constexpr u8 U8_MIN = 0;
constexpr u8 U8_MAX = 0xff;

using u16 = unsigned short;
constexpr u16 U16_MIN = 0;
constexpr u16 U16_MAX = 0xffff;

using u32 = unsigned int;
constexpr u32 U32_MIN = 0;
constexpr u32 U32_MAX = 0xffffffff;

using u64 = unsigned long long;
constexpr u64 U64_MIN = 0;
constexpr u64 U64_MAX = 0xffffffffffffffff;

using usize = u64;
constexpr usize USIZE_MIN = U64_MIN;
constexpr usize USIZE_MAX = U64_MAX;

static_assert(sizeof(u8) == 1, "u8 should only be 1 byte");
static_assert(sizeof(u16) == 2, "u16 should only be 2 bytes");
static_assert(sizeof(u32) == 4, "u32 should only be 4 bytes");
static_assert(sizeof(u64) == 8, "u64 should only be 8 bytes");
static_assert(sizeof(usize) == 8, "usize should only be 8 bytes");

using i8 = signed char;
constexpr i8 I8_MIN = (-127 - 1);
constexpr i8 I8_MAX = 127;

using i16 = short;
constexpr i16 I16_MIN = (-32767 - 1);
constexpr i16 I16_MAX = 32767;

using i32 = int;
constexpr i32 I32_MIN = (-2147483647 - 1);
constexpr i32 I32_MAX = 2147483647;

using i64 = long long;
constexpr i64 I64_MIN = (-9223372036854775807 - 1);
constexpr i64 I64_MAX = 9223372036854775807;

using isize = i64;
constexpr isize ISIZE_MIN = I64_MIN;
constexpr isize ISIZE_MAX = I64_MAX;

static_assert(sizeof(i8) == 1, "i8 should only be 1 byte");
static_assert(sizeof(i16) == 2, "i16 should only be 2 bytes");
static_assert(sizeof(i32) == 4, "i32 should only be 4 bytes");
static_assert(sizeof(i64) == 8, "i64 should only be 8 bytes");
static_assert(sizeof(isize) == 8, "isize should only be 8 bytes");

using f32 = float;
constexpr f32 F32_MIN = 1.17549435e-38F;
constexpr f32 F32_MAX = 3.40282347e+38F;

using f64 = double;

static_assert(sizeof(f32) == 4, "f32 should only be 4 bytes");
static_assert(sizeof(f64) == 8, "f64 should only be 8 bytes");

using NullPtr = decltype(nullptr);

using wchar = wchar_t;

CORE_NAMESPACE_END

// Export primitive types out of core namespace
using eu::core::f32;
using eu::core::f64;
using eu::core::i16;
using eu::core::i32;
using eu::core::i64;
using eu::core::i8;
using eu::core::isize;
using eu::core::NullPtr;
using eu::core::u16;
using eu::core::u32;
using eu::core::u64;
using eu::core::u8;
using eu::core::usize;
using eu::core::wchar;

// Turn on asserts if compiled in debug
#if defined(_DEBUG)
	#define ENABLE_ASSERTS
#endif

SUPPRESS_WARNING_PUSH
MSVC_SUPPRESS_WARNING(4514)

bool _assert_failed(bool must_crash, const char* expression,
					const char* message, const char* file, u32 line);

#ifdef ENABLE_ASSERTS
struct AssertLastParam {};
inline bool _assert_failed_helper(bool must_crash, const char* expression,
								  const char* file, u32 line, AssertLastParam) {
	return _assert_failed(must_crash, expression, nullptr, file, line);
}
inline bool _assert_failed_helper(bool must_crash, const char* expression,
								  const char* file, u32 line,
								  const char* message, AssertLastParam) {
	return _assert_failed(must_crash, expression, message, file, line);
}

	// Crashes application if expression evaluates to false. Usage:
	// ASSERT(condition) or ASSERT(condition, message)
	#define ASSERT(expression, ...)                                            \
		do {                                                                   \
			if (!(expression) &&                                               \
				_assert_failed_helper(true, #expression, __FILE__,             \
									  u32(__LINE__), ##__VA_ARGS__,            \
									  AssertLastParam()))                      \
				CRASH;                                                         \
		} while (false)

	// Halts application if expression evaluates to false but can resume. Usage:
	// ENSURE(condition) or ENSURE(condition, message)
	#define ENSURE(expression, ...)                                            \
		do {                                                                   \
			if (!(expression) &&                                               \
				_assert_failed_helper(false, #expression, __FILE__,            \
									  u32(__LINE__), ##__VA_ARGS__,            \
									  AssertLastParam()))                      \
				BREAKPOINT;                                                    \
		} while (false)
#else
	#define ASSERT(...) ((void)0)
	#define ENSURE(...) ((void)0)
#endif // ENABLE_ASSERTS

SUPPRESS_WARNING_POP
